In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
WARNING: There was an error checking the latest version of pip.

In [1]:
%load_ext sql

In [2]:
import os

USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

In [3]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)
CONNECT_DATA

'postgresql://reader:Miba2021@10.129.0.25/demo'

In [4]:
%%sql $CONNECT_DATA
    SELECT * FROM pg_database

4 rows affected.

[(13760, 'postgres', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', False, True, -1, 13759, '726', '1', 1663, None),
 (1, 'template1', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', True, True, -1, 13759, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (13759, 'template0', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', True, False, -1, 13759, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (16384, 'demo', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', False, True, -1, 13759, '726', '1', 1663, '{=Tc/postgres,postgres=CTc/postgres,reader=c/postgres}')]

***Question 1***

***A query with JOIN***

In [36]:
%sql SELECT passenger_name, arrival_airport, city as arrival_city \
    FROM tickets t \
    JOIN ticket_flights tf ON tf.ticket_no = t.ticket_no \
    JOIN flights f ON f.flight_id = tf.flight_id \
    JOIN airports ap ON f.arrival_airport = ap.airport_code \
    WHERE t.ticket_no = '0005432312164'

 * postgresql://reader:***@10.129.0.25/demo
4 rows affected.

[('ALEKSEY GERASIMOV', 'EGO', 'Belgorod'),
 ('ALEKSEY GERASIMOV', 'EGO', 'Belgorod'),
 ('ALEKSEY GERASIMOV', 'DME', 'Moscow'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'Anapa')]

***A query without subqueries or joins***

In [6]:
%sql SELECT t.passenger_name, f.arrival_airport, ap.city as arrival_city \
    FROM tickets t, airports ap, ticket_flights tf, flights f \
    WHERE t.ticket_no = '0005432312164' \
    AND t.ticket_no = tf.ticket_no \
    AND tf.flight_id = f.flight_id \
    AND f.arrival_airport = ap.airport_code

 * postgresql://reader:***@10.129.0.25/demo
4 rows affected.

[('ALEKSEY GERASIMOV', 'EGO', 'Belgorod'),
 ('ALEKSEY GERASIMOV', 'EGO', 'Belgorod'),
 ('ALEKSEY GERASIMOV', 'DME', 'Moscow'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'Anapa')]

***A nested query***

In [40]:
%%sql $CONNECT_DATA
    SELECT city, (SElECT passenger_name FROM tickets WHERE ticket_no = '0005432312164')
    FROM airports WHERE airport_code IN(
        SELECT arrival_airport FROM flights WHERE flight_id IN(
            SELECT flight_id FROM ticket_flights WHERE ticket_no IN(
                SELECT ticket_no FROM tickets WHERE ticket_no = '0005432312164')))

3 rows affected.

[('Anapa', 'ALEKSEY GERASIMOV'),
 ('Belgorod', 'ALEKSEY GERASIMOV'),
 ('Moscow', 'ALEKSEY GERASIMOV')]

***Question 2***

In [8]:
%sql SELECT a1.city as departure_city, a2.city as arrival_city \
    FROM airports a1 \
    JOIN flights f ON a1.airport_code = f.departure_airport \
    JOIN airports a2 ON a2.airport_code = f.arrival_airport \
    JOIN ticket_flights tf ON tf.flight_id = f.flight_id \
    JOIN tickets t ON t.ticket_no = tf.ticket_no \
    WHERE t.passenger_name = 'ELLA DMITRIEVA'

 * postgresql://reader:***@10.129.0.25/demo
7 rows affected.

[('Moscow', 'Yuzhno-Sakhalinsk'),
 ('Moscow', 'Khanty-Mansiysk'),
 ('Khanty-Mansiysk', 'Moscow'),
 ('Moscow', 'Yekaterinburg'),
 ('Yekaterinburg', 'Moscow'),
 ('Yekaterinburg', 'Magnetiogorsk'),
 ('Magnetiogorsk', 'Yekaterinburg')]

***Question 3***

In [41]:
%sql SELECT a.model, COUNT(s.seat_no) as seats \
    FROM aircrafts a\
    JOIN seats s ON s.aircraft_code = a.aircraft_code \
    GROUP BY a.model \
    ORDER BY seats desc

 * postgresql://reader:***@10.129.0.25/demo
9 rows affected.

[('Boeing 777-300', 402),
 ('Boeing 767-300', 222),
 ('Airbus A321-200', 170),
 ('Airbus A320-200', 140),
 ('Boeing 737-300', 130),
 ('Airbus A319-100', 116),
 ('Sukhoi Superjet-100', 97),
 ('Bombardier CRJ-200', 50),
 ('Cessna 208 Caravan', 12)]